掘金文章监控.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="掘金文章在线监控" enabled="true">
      <stringProp name="TestPlan.comments">检查文章是否在线 + 读取当前阅读量</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="用户定义的变量" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="article_id" elementType="Argument">
            <stringProp name="Argument.name">article_id</stringProp>
            <stringProp name="Argument.value">7680108144007905343</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="监控线程组(1用户/1次)">
        <intProp name="ThreadGroup.num_threads">5</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="循环控制器">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="浏览器请求头(反爬必需)" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">User-Agent</stringProp>
              <stringProp name="Header.value">Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/128.0.0.0 Safari/537.36</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Accept</stringProp>
              <stringProp name="Header.value">text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,*/*;q=0.8</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Accept-Language</stringProp>
              <stringProp name="Header.value">zh-CN,zh;q=0.9,en;q=0.8</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="间隔60秒(周期巡检时启用)" enabled="false">
          <stringProp name="ConstantTimer.delay">60000</stringProp>
        </ConstantTimer>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="打开掘金文章" enabled="true">
          <intProp name="HTTPSampler.connect_timeout">10000</intProp>
          <intProp name="HTTPSampler.response_timeout">20000</intProp>
          <stringProp name="HTTPSampler.domain">juejin.cn</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
          <stringProp name="HTTPSampler.path">/post/${article_id}</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="断言1:响应码=200(文章可访问)" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="断言2:正文含owntools(文章内容在线)" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="1676926485">owntools</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">16</intProp>
          </ResponseAssertion>
          <hashTree/>
          <DurationAssertion guiclass="DurationAssertionGui" testclass="DurationAssertion" testname="断言3:响应时间小于15秒" enabled="true">
            <stringProp name="DurationAssertion.duration">25000</stringProp>
          </DurationAssertion>
          <hashTree/>
          <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="提取阅读量并记录历史" enabled="true">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">def html = prev.getResponseDataAsString()
def m = (html =~ /views-count[^&gt;]*&gt;\s*(\d+)/)
if (m.find()) {
    def rc = m.group(1)
    vars.put(&apos;read_count&apos;, rc)
    def sm = (html =~ /class=&quot;count&quot;[^&gt;]*&gt;\s*(\d+)/)
    def nums = []
    while (sm.find()) { nums.add(sm.group(1)) }
    def dg = nums.size() &gt;= 1 ? nums[0] : &apos;?&apos;
    def cm = nums.size() &gt;= 3 ? nums[2] : &apos;?&apos;
    def sdf = new java.text.SimpleDateFormat(&apos;yyyy-MM-dd HH:mm:ss&apos;)
    def line = sdf.format(new Date()) + &apos;,&apos; + rc + &apos;,&apos; + dg + &apos;,&apos; + cm
    new File(&apos;juejin_readcount_history.csv&apos;).append(line + &apos;\n&apos;, &apos;UTF-8&apos;)
    prev.setSampleLabel(prev.getSampleLabel() + &apos; [阅读量=&apos; + rc + &apos; 点赞=&apos; + dg + &apos; 评论=&apos; + cm + &apos;]&apos;)
    println(&apos;READ_COUNT=&apos; + rc)
    log.info(&apos;READ_COUNT=&apos; + rc)
} else {
    new File(&apos;juejin_page_full.html&apos;).write(html, &apos;UTF-8&apos;)
    prev.setSampleLabel(prev.getSampleLabel() + &apos; [未找到阅读量,页面len=&apos; + html.length() + &apos;]&apos;)
    println(&apos;READ_COUNT_NOT_FOUND html_len=&apos; + html.length())
}</stringProp>
          </JSR223PostProcessor>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="查看结果树(GUI看这个)">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="聚合报告(Err=0即正常)">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SimpleDataWriter" testclass="ResultCollector" testname="结果写入juejin-watch.jtl(留历史记录)" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">juejin-watch.jtl</stringProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>